const offerServices = [
  {
    id:1,
    title: "سزارین و زایمان فیزیولوژیک",
    description: "تجربه زایمان کم‌درد و آسان با بهره‌گیری از تکنیک‌های ورزشی، نقاط فشار، پوزیشن‌های مناسب و روش‌های نوین مدیریت درد."
  },
  {
    id:2,
    title: "جراحی‌های درمانی و زیبایی زنان",
    description: "اصلاح سیستوسل و رکتوسل، تایتنینگ و وایتنینگ واژن و لابیاپلاستی با استفاده از پیشرفته‌ترین روش‌های لیزری و جراحی."
  },
  {
    id:3,
    title: "پاپ اسمیر و بایوپسی",
    description: "نمونه‌برداری دقیق از دهانه رحم و آندومتر جهت تشخیص زودهنگام سرطان و بررسی علت خونریزی‌های غیرطبیعی (به‌ویژه در سنین بالای ۴۰ سال)."
  },
  {
    id:4,
    title: "هموپاتی تخصصی زنان",
    description: "درمان‌های مکمل و نوین برای مدیریت نازایی‌های ناشناخته، تنبلی تخمدان، یائسگی زودرس و عفونت‌های اودکننده زنان."
  },
  {
    id:5,
    title: "اوریکولوتراپی",
    description: "استفاده از تکنولوژی‌های نوین در درمان اختلالات هورمونی، تنبلی تخمدان و بهبود شرایط سلامت عمومی زنان."
  },
  {
    id:6,
    title: "فیشال و مراقبت‌های پوست",
    description: "پاکسازی، جوانسازی و بهبود کیفیت پوست با استفاده از متدهای روز دنیا جهت درخشش و سلامت چهره."
  },
  {
    id:7,
    title: "تعیین جنسیت فرزند",
    description: "خدمات تخصصی و علمی جهت انتخاب جنسیت فرزند بر اساس پروتکل‌های دقیق پزشکی و تکنولوژی‌های نوین."
  },
  {
    id:8,
    title: "لیزر موهای زائد",
    description: "حذف دائمی و ایمن موهای زائد با استفاده از دستگاه‌های پیشرفته، بدون درد و با کمترین زمان جلسات درمانی."
  }
];





export {offerServices}